{
  "nav": {
    "home": "Inicio",
    "about": "Sobre mí",
    "projects": "Proyectos",
    "stack": "Tecnologías",
    "services": "Certificaciones",
    "contact": "Contacto",
    "contactMe": "Contáctame",
    "viewCV": "Ver CV",
    "cv": "CV"
  },
  "home": {
    "hello": "Hola, soy Gabriel Esperilla",
    "role": "Ingeniero de Software Full-Stack",
    "from": "del Tecnológico de Monterrey",
    "description": "Ingeniero de software en formación con experiencia en desarrollo full-stack e inteligencia artificial. Apasionado por crear soluciones web modernas, integrar modelos de lenguaje y automatizar procesos inteligentes.",
    "hire": "Contratar",
    "contactMe": "Contáctame"
  },
  "about": {
    "title": "Sobre mí",
    "description": "Me considero una persona resiliente, siempre trato de dar lo mejor de mí para cumplir con mis objetivos y a pesar de los problemas, me esforzaré hasta cumplir todos mis objetivos y metas.",
    "skills": "Habilidades"
  },
  "projects": {
    "title": "Mis proyectos",
    "viewGithub": "Ver en Github",
    "viewLive": "Ver demo",
    "viewCode": "Ver código",
    "descriptions": {
      "awaqEcoGuardians": "Sitio web desarrollado en colaboración con la ONG colombiana AWAQ, quienes nos pidieron integrar su videojuego en WebGL. El proyecto combina diseño responsivo con tecnologías modernas como React y Tailwind CSS.",
      "gptClone": "Clon de ChatGPT desarrollado con React y Tailwind CSS, que utiliza la API de OpenAI para generar respuestas en tiempo real, integrando una interfaz responsiva y moderna. Ideal para integrar el uso de LLMs en aplicaciones web.",
      "predictorGastos": "Script de Python desarrollado con scikit-learn que permite predecir gastos futuros a partir de un archivo Excel con formato predefinido. El usuario puede subir su archivo .xlsx y el modelo realiza un análisis de regresión lineal para estimar el comportamiento de sus gastos. Incluye visualizaciones usando matplotlib.",
      "huertoIOT": "Programa embebido en Arduino con ESP32 que mide temperatura, humedad y luz. Los datos se envían vía WiFi a Azure y se visualizan en un dashboard en tiempo real. Según valores predefinidos, se activan actuadores de riego, ventilación y sombreado automático para controlar las condiciones del huerto."
    }
  },
  "stack": {
    "title": "MIS TECNOLOGÍAS",
    "frontend": "FrontEnd",
    "backend": "BackEnd",
    "database": "Base de Datos",
    "tools": "Herramientas"
  },
  "services": {
    "title": "Certificaciones",
    "cards": {
      "javascript": {
        "title": "Programación con JavaScript",
        "description": "Obtuve esta certificación oficial impartida por Meta, donde fortalecí mis conocimientos en JavaScript y desarrollo de aplicaciones web. A lo largo del curso, aprendí a escribir código limpio y estructurado, crear y manipular objetos y arreglos, aplicar principios de diseño funcional, trabajar con Node.js y desarrollar programas orientados a eventos. Esta formación me permitió afianzar habilidades clave como el pensamiento lógico, el desarrollo web funcional y la programación moderna con JavaScript.",
        "date": "Feb 2024 - May 2024",
        "viewCredential": "Ver credencial"
      },
      "frontend": {
        "title": "Desarrollo Web Front-End",
        "description": "Obtuve la certificación Introduction to Front-End Development impartida por Meta en Coursera, donde aprendí a crear y estilizar páginas web con CSS y TailwindCSS tambien a aplicar diseño responsivo y a utilizar frameworks como React.js. Desarrollé habilidades clave en desarrollo de interfaces, diseño adaptable, diseño de UX/UI y uso de herramientas modernas para aplicaciones web",
        "date": "Oct 2023 - Feb 2024",
        "viewCredential": "Ver credencial"
      },
      "responsive": {
        "title": "Diseño Web Responsivo",
        "description": "Obtuve la certificación Responsive Web Design de freeCodeCamp, con una duración aproximada de 300 horas, donde desarrollé habilidades sólidas en diseño y desarrollo de interfaces web adaptables. Aprendí a crear sitios web semánticos y accesibles, implementando principios de diseño responsivo, organización estructurada del contenido y compatibilidad multiplataforma. Esta formación consolidó mis competencias en diseño centrado en el usuario y buenas prácticas de maquetado web.",
        "date": "May 2024 - Sep 2024",
        "viewCredential": "Ver credencial"
      },
      "algorithms": {
        "title": "Algoritmos y Estructuras de Datos JavaScript",
        "description": "Obtuve la certificación JavaScript Algorithms and Data Structures otorgada por freeCodeCamp, con una duración aproximada de 300 horas. Esta formación me permitió desarrollar competencias avanzadas en estructuras de datos, algoritmos, programación funcional, manejo de estructuras lógicas complejas, validaciones y control de flujo en JavaScript. Consolidé habilidades clave para resolver problemas de programación de forma eficiente, aplicando buenas prácticas de desarrollo y pensamiento algorítmico riguroso.",
        "date": "Oct 2024 - Ene 2025",
        "viewCredential": "Ver credencial"
      }
    }
  },
  "contact": {
    "title": "Contacto",
    "fullName": "Nombre completo",
    "email": "Correo electrónico",
    "message": "Mensaje",
    "submit": "Enviar",
    "placeholders": {
      "fullName": "Nombre completo",
      "email": "ejemplo@email.com",
      "message": "Deja un mensaje"
    }
  },
  "footer": {
    "location": "Mexico City, México",
    "aboutServices": "Sobre mis servicios",
    "aboutDescription": "Estoy disponible en cualquier momento, no dudes en solicitar información o contactarte conmigo",
    "portfolioStack": "Tecnologías del Portfolio"
  },
  "language": {
    "en": "Inglés",
    "es": "Español"
  }
}
